app/controllers/songs_controller.rb

  def index
    @artist = Artist.find(params[:artist_id])
    @songs = @artist.songs.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1  [["artist_id", 1]]

  def new
    @artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @artist = Artist.find(params[:artist_id])
    @song = @artist.songs.create(song_params)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "songs" ("title", "album", "preview_url", "artist_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "No No No"], ["album", "Not Again!"], ["preview_url", "nope.mp3"], ["artist_id", 0]]

  def show
    @artist = Artist.find(params[:artist_id])
    @song = Song.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @artist = Artist.find(params[:artist_id])
    @song = Song.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @artist = Artist.find(params[:artist_id])
    @song = Song.find(params[:id])
    @song.update(song_params)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "songs" SET "album" = $1 WHERE "songs"."id" = $2  [["album", "Fever to Smell"], ["id", 1]]

  def destroy
    @artist = Artist.find(params[:artist_id])
    @song = Song.find(params[:id])
    @song.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 254]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 254]]